# 1. Import libraries and data

# 2. Data Consistency Checks

# 3. Adressing Missing Values

# 4. Duplicates

# 5. Task 4.5

# ----------------------------------------------------------------------------------------

# Import libraries

In [66]:
import pandas as pd
import numpy as np 
import os

# Import Data

In [67]:
#create string for the path 
path = r'C:\Users\kilia\OneDrive\CareerFoundry\Projects\Data Immersion Course\Achievement 4\Instacart Basket Analysis_04-2023\02 Data\Original Data'
path1 = r'C:\Users\kilia\OneDrive\CareerFoundry\Projects\Data Immersion Course\Achievement 4\Instacart Basket Analysis_04-2023'

In [68]:
#Import Orders.csv dataset
df_ords = pd.read_csv(os.path.join(path1,'02 Data', 'Prepared Data','orders_wrangled.csv'), index_col = 0)

In [69]:
#Import Products.csv dataset
df_prods = pd.read_csv(os.path.join(path,'products.csv'), index_col = False)

# Data Consistency Checks
# Mixed-Type Data

In [70]:
# Create Dataframe 
df_test = pd.DataFrame()

In [71]:
# Create a mixed type column 
df_test['mix'] = ['a', 'b', 1, True]

In [72]:
df_test

    mix
0     a
1     b
2     1
3  True

In [73]:
# Check for mixed type columns, prints all column names with mixed types 
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [74]:
# set the "mix" column to string type 
df_test['mix'] = df_test['mix'].astype('str')

# Missing Values

In [75]:
# find missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [76]:
#create dataframe with only NaN values on the product_name column 
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [77]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# Addressing Missing Values

In [78]:
# code to fill NaN values 
# df['column with missings'].fillna(median value, inplace=True)

In [79]:
df_prods.shape

(49693, 5)

In [80]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [81]:
df_prods_clean.shape

(49677, 5)

In [82]:
# command to drop all missing values
    # df_prods.dropna(inplace = True)
# only dropping NaN values from a particular column 
    # df_prods.dropna(subset = [‘product_name’], inplace = True)

# Duplicates

In [83]:
# Command to look for FULL DUPLICATES in the dataset 
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [84]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [85]:
df_prods_clean.shape

(49677, 5)

In [86]:
# Command to drop duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [87]:
df_prods_clean_no_dups.shape

(49672, 5)

# Exporting Dataframe as CSV

In [88]:
df_prods_clean_no_dups.to_csv(os.path.join(path1, '02 Data','Prepared Data', 'Products_checked.csv'))

# Task 4.5

In [89]:
# Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.
# Tip: Keep an eye on min and max values!
df_ords.describe().astype(int)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3421083,3421083,3421083,3421083,3421083,3214874
mean,1710542,102978,17,2,13,11
std,987581,59533,17,2,4,9
min,1,1,1,0,0,0
25%,855271,51394,5,1,10,4
50%,1710542,102689,11,3,13,7
75%,2565812,154385,23,5,16,15
max,3421083,206209,100,6,23,30

The descriptive statistics looks normal

In [90]:
# 3. Check for mixed-type data in your df_ords dataframe.
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
# 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.
# no print means no mixed data types found

In [91]:
# 5. Run a check for missing values in your df_ords dataframe.
# In a markdown cell, report your findings and propose an explanation for any missing values you find.
df_ords.isnull().sum()

order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

The missing values in the days_since_last_order could be due to first time purchases by customers, I'll check the amount of user_id's to see if we have 2062099 users in the dataframe. Every user would have been made an first purchase with one NaN value.

In [94]:
#check user_id amount 
df_ords['user_id'].max()

206209

In [104]:
#create df with duplicates
df_ords_dup = df_ords[df_ords['days_since_last_order'].isnull() == True]

In [105]:
df_ords_dup

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [111]:
# check user_id for duplicates
df_ords_dup['user_id'].duplicated().sum()

0

6. Address the missing values using an appropriate method.
In a markdown cell, explain why you used your method of choice.



no duplicates found in the user_id column, now I can be sure that every NaN value is because of a first time order. I'll let the NaN values as they are. I can view them as first time orders.

In [113]:
# 7.Run a check for duplicate values in your df_ords data.
# In a markdown cell, report your findings and propose an explanation for any duplicate values you find.
df_ords_dup.duplicated().sum()

0

no duplicates found

In [115]:
# 8. Address the duplicates using an appropriate method.
# In a markdown cell, explain why you used your method of choice.

No duplicates found in step 7 to address

In [116]:
# 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.
df_ords.to_csv(os.path.join(path1, '02 Data','Prepared Data', 'Orders_checked.csv'))